import pandas as pd
marks = {
    "Audi": [2000,1],
    "BMW":[2500,2],
    "Ford": [3000,3],
    "Lexus": [1750,4],
    "Chevrolet": [3400,5],
    "Kia": [2200,6],
    "Honda": [2800,7],
    "Nissan": [3500,8],
    "Toyota": [3200,9],
    "Skoda": [1900,10],
}
#перетворення на датафрейм
df = pd.DataFrame.from_dict(marks, orient = "index")
df.columns = ["Ціна марки", "Рік"]
#Вивід перших трьох рядків датафрейму
print("Перші три рядки DataFrame:")
print(df.head(3))
#перевірка типів даних датафрейму
print("Перевірка типів даних:")
print(df.dtypes)
#визначення кількості рядків та стовпців датафрейму
print("Визначення кількості рядків і стовпців: ",df.shape)
#Описова статистика
print("Описова статистика")
DF = df.drop(columns=["Рік"])
print(DF.describe().round(1))
#додавання стовпця з розрахунковими значеннями
print("Додавання стовпця з розрахунковими значеннями :")
df["Коефіцієнт"] = (1.3,1.2, 1.15, 0.9,0.85,0.76,0.7,0.68,0.6,0.45)
df["Фінальна ціна"] = df["Ціна марки"]*df["Коефіцієнт"]
print(df)
#Фільтрація даних
print("Фільтрація даних за фінальною ціною, яка більше 2000:")
df_filter = df[df["Фінальна ціна"]>2000]
print(df_filter)
#Сортування за зростанням
print("Сортування за фінальною ціною за зростанням:")
print(df.sort_values(by = "Фінальна ціна"))
print("")
#групування даних
print("Групування за регіоном по фінальній ціні і знаходження середнього значення")
df["Регіон"] = ["Європа", "Європа", "Америка", "Азія", "Америка","Азія", "Азія", "Азія", "Азія", "Європа"]
Group = df.groupby("Регіон")["Фінальна ціна"].mean()
print(Group.round(1))
#агрегація даних
print("Агреговані дані за регіоном по фінальній ціні:")
Agergovani = df.groupby("Регіон")["Фінальна ціна"].agg(["min","max","count","sum"])
print(Agergovani)
